<?php

require_once("GalaxyHelper.php");


// Star 6
$x1 = 88240;
$y1 = 48813;

// Jifio  herc 39 min, loki 15 min
$x2 = 87463;
$y2 = 46540;

// yaphium herc 46 min
#$x2 = 85402;
#$y2 = 48724;
#
#// Szisio herc 73,5 min
#$x2 = 91760;
#$y2 = 51638;
#
#// Rucrio herc 95 min, loki 38 min
#$x2 = 85378;
#$y2 = 53922;



// g01
$x1 = 48575;
$y1 = 88828;
// gr09 herc 17 hours 42 min (63735 sec)
$x2 = 78556;
$y2 = 30852;

$income_per_hour = 3000;
$speed = GalaxyHelper::HerculesSpeed;


$path = GalaxyHelper::PathLen($x1, $y1, $x2, $y2);
echo "Path: " . $path . "\n";


$time = GalaxyHelper::PathTime($path, $speed);
echo "Time: " . $time . " (" . intval($time / 60) . ")\n";

$count = GalaxyHelper::CalcOptimalHerculesCount($income_per_hour, $x1, $y1, $x2, $y2);
echo "Units: $count\n";

/*
Чтобы определить сколько нужно геркулесов, нужно:
1) Расчитать кол-во добываемых минералов в секунду
3) Суммарное время, которое геркулес пролетает от планеты до орбитальной станции, и обратно
2) За сколько 1 геркулес выполнит перелет с планеты до орбитальной станции со 100 минералами туда и обратно

1) 1680 в час, 28 в минуту, 0.46 в 1 секунду (добыча минералов).
   Значит 1% от 1 минерала / 100 = 0.01
   0.46 / 0.01 = 46% от 1 минерала добывается за 1 секунду
   1 секунда / 46% * 100% = 2,17 секунд требуется на добычу 1 минерала
2) 95 * 2 = 190 минут, 11400 секунд (за которые могут быть доставлены 100 минералов)
3) Так как 100 минералов добывается за 100*2,17 = 217 секунд, значит нужно чтобы всего было 11400/217=52 геркулеса

Алгоритм
1) Определяем требуемое количество геркулесов на планете
2) Открываем радар на планете и смотрим отправляемые или входящие с или на эту планету. На другие не нужно. 
	- На каждую планету смотрим есть ли в списке наших планет. Если юниты видны, то ничего не делать
	- Если юнитов не видно, то по каждой такой планете выполнить запрос на радар и просуммировать все отправления с геркулесами
3) Прибавляем количество строящихся геркулесов в заводах
4) Прибавляем количество свободных геркулесов на планете

Итого разницу распределяем на постройку. 
Если разница отрицительная, то излишек отправляем на ту планету, для которой требуется больше геркулесов.
Это можно реализовать через кеширование всех данных с планет.
[
	planet1
		factories[1,2,3,4,5]
		total_hercules = 50
		hercules_required = 55
]
В конце всего смотрим у кого излишек, и если он есть, то отправляем запрос на "поддержку" от текущей планеты ко всем остальным. И в кеше прибавляем и убавляем тоже. И так по каждой планете пройтись.

 распределяем по этим 5 заводам по 1 геркулесу

 
 
 
 
 
 [15.01.2020 00:56:05] [b13] b11 Hercules: 392 / 190 / -202
[15.01.2020 00:56:05] [b13] b03 Hercules: 127 / 20 / -107
[15.01.2020 00:56:05] [b13] g06 Hercules: 415 / 34 / -381
[15.01.2020 00:56:05] [b13] g02 Hercules: 697 / 13 / -684
[15.01.2020 00:56:05] [b13] b12 Hercules: 493 / 205 / -288
[15.01.2020 00:56:05] [b13] b08 Hercules: 383 / 61 / -322
[15.01.2020 00:56:05] [b13] y02 Hercules: 388 / 12 / -376
[15.01.2020 00:56:05] [b13] y04 Hercules: 253 / 57 / -196
[15.01.2020 00:56:05] [b13] r01 Hercules: 241 / 103 / -138
[15.01.2020 00:56:05] [b13] b01 Hercules: 180 / 21 / -159
[15.01.2020 00:56:05] [b13] y03 Hercules: 361 / 11 / -350
[15.01.2020 00:56:05] [b13] g05 Hercules: 292 / 25 / -267
[15.01.2020 00:56:05] [b13] gr02 Hercules: 316 / 103 / -213
[15.01.2020 00:56:05] [b13] gr07 Hercules: 792 / 989 / 197
[15.01.2020 00:56:05] [b13] gr03 Hercules: 478 / 729 / 251
[15.01.2020 00:56:05] [b13] g04 Hercules: 196 / 40 / -156
[15.01.2020 00:56:05] [b13] r02 Hercules: 290 / 146 / -144
[15.01.2020 00:56:05] [b13] b04 Hercules: 224 / 48 / -176
[15.01.2020 00:56:05] [b13] b05 Hercules: 196 / 18 / -178
[15.01.2020 00:56:05] [b13] gr08 Hercules: 900 / 1077 / 177
[15.01.2020 00:56:05] [b13] y13 Hercules: 900 / 969 / 69
[15.01.2020 00:56:05] [b13] gr05 Hercules: 943 / 775 / -168
[15.01.2020 00:56:05] [b13] b10 Hercules: 443 / 129 / -314
[15.01.2020 00:56:05] [b13] gr04 Hercules: 797 / 886 / 89
[15.01.2020 00:56:05] [b13] b07 Hercules: 100 / 23 / -77
[15.01.2020 00:56:05] [b13] y05 Hercules: 756 / 1368 / 612
[15.01.2020 00:56:05] [b13] gr01 Hercules: 279 / 67 / -212
[15.01.2020 00:56:05] [b13] b15 Hercules: 422 / 212 / -210

[15.01.2020 00:56:05] [b13] g01 Hercules:  /  / 
[15.01.2020 00:56:05] [b13] y11 Hercules: 269 / 88 / -181
[15.01.2020 00:56:05] [b13] r03 Hercules: 357 / 154 / -203
[15.01.2020 00:56:05] [b13] y09 Hercules: 457 / 78 / -379
[15.01.2020 00:56:05] [b13] gr10 Hercules: 713 / 1098 / 385
[15.01.2020 00:56:05] [b13] g05 Hercules: 270 / 99 / -171
[15.01.2020 00:56:05] [b13] y12 Hercules: 189 / 183 / -6
[15.01.2020 00:56:05] [b13] y06 Hercules: 854 / 1396 / 542
[15.01.2020 00:56:05] [b13] gr06 Hercules: 800 / 985 / 185
[15.01.2020 00:56:05] [b13] b06 Hercules: 421 / 21 / -400
[15.01.2020 00:56:05] [b13] g07 Hercules: 534 / 127 / -407
[15.01.2020 00:56:05] [b13] gr09 Hercules: 868 / 1092 / 224
[15.01.2020 00:56:05] [b13] y07 Hercules: 1165 / 1397 / 232
[15.01.2020 00:56:05] [b13] y08 Hercules: 2013 / 1395 / -618
[15.01.2020 00:56:05] [b13] b02 Hercules: 115 / 15 / -100
[15.01.2020 00:56:05] [b13] y10 Hercules: 449 / 55 / -394
[15.01.2020 00:56:05] [b13] g03 Hercules: 449 / 22 / -427
[15.01.2020 00:56:05] [b13] y01 Hercules: 350 / 22 / -328
[15.01.2020 00:56:05] [b13] b09 Hercules: 361 / 172 / -189
[15.01.2020 00:56:05] [b13] b14 Hercules: 589 / 223 / -366
[15.01.2020 00:56:05] [b13] b13 Hercules: 239 / 211 / -28
*/